# EXL_ReadFile

## Description
Read Excel file.

```pascal
FUNCTION EXL_ReadFile(FilePath : STRING) : BOOLEAN;
```

```python

def vs.EXL_ReadFile(FilePath):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|FilePath|STRING||

## Version
Availability: from Vectorworks 2021
## Category
* Excel